#include <bits/stdc++.h>
using namespace std;
int main()
{    
	cout<<0x7F<<endl;//7*16+15
	cout<<0xFF<<endl;//15*16+15
	int x=1;// 0001 第0-3位分别是1000
	int y=6;// 0110 
	x^=y;   // 0111 c++中^为异或运算 
	cout<<x<<endl<<endl;// 7
	
	/*32位补码                          int(十进制)    int(十六进制) 
	00000000000000000000000000000000    0              0x0 
	01111111111111111111111111111111    2 147 483 647  0x7F FF FF FF
	00111111001111110011111100111111    1 061 109 567  0x3F 3F 3F 3F  
	11111111111111111111111111111111                   0xFF FF FF FF
	*/
	cout<<0x3F3F3F3F<<endl;//1061109567表示最大整数 
	int a[8];
	memset(a,0x3f,sizeof(a));//0x3f给数组赋0x3F 3F 3F 3F
	for(int i=0;i<8;i++) cout<<a[i]<<" ";
	cout<<endl<<endl;
	
	/*
	移位运算 
	左移 二进制表示下 数字同时左移，低位填0，高位越界舍弃
	*/
	int n=14;
	     //0 1110       01 1100 把n向左移1位 
	cout<<"n = "<<n<<" n<<1 = "<<(n<<1)<<"  n*(2^1)"<<endl;
	n=5; //1            10 0000 把1向左移n位 
	cout<<"n = "<<n<<"  1<<n = "<<(1<<n)<<"  1*(2^n)"<<endl; 
	     //
	/*
	算术右移 二进制补码表示下 数字同时右移，低位舍弃，高位以符号位填充 
	*/                              //符合位为左边第一位 0表示正数 
	n=-9;                           //一般情况 符号位为0 
	cout<<"n = "<<n<<" n>>2 = "<<(n>>2)<<"  [n/(2.0^2)]"<<endl;
	n=3;                                   //向下取整 
	cout<<"n = "<<n<<"  65>>n = "<<(65>>n)<<"  [65/(2.0^n)]"<<endl; 
	cout<<endl; 
	
	/*
	逻辑右移 二进制补码表示下 数字同时右移，高位填0，低位越界舍弃
	*/ 
} 
